{"pages":[{"title":"ReturButikenOnline","text":"","tags":"","url":"index.html"},{"title":"Home","text":"Welcome to the ReturButikenOnline documentation!","tags":"","url":"en\/Home.html"},{"title":"Setup","text":"Gettings started First, make sure that needed* tools are available on the system PHP * PHP &gt;= 5.6.4 OpenSSL PHP Extension PDO PHP Extension Mbstring PHP Extension Tokenizer PHP Extension XML PHP Extension Composer * NodeJS &amp; npm * Git Get the repository # example with git git clone https:\/\/github.com\/Viva-Resurs\/ReturButikenOnline.git cd ReturButikenOnline Install dependencies # install PHP-packages composer install # install npm-packages npm install Advanced \/ Troubleshooting When running composer install, the following important commands will be runned: # Create a database file touch database\/database.sqlite # Setup enviroment variables and generate application key for Laravel php -r &quot;file_exists('.env') || copy('.env.example', '.env');&quot; php artisan key:generate When running npm install, the following commands will be runned to setup GUI: # Create folders for js &amp; css files npm run create-folders # Copy needed fonts (icons) npm run copy-assets # Copy vendor css (semantic-ui) npm run copy-css # Build js &amp; css to create GUI npm run build","tags":"","url":"en\/Getting_started\/Setup.html"},{"title":"User interface","text":"User interface Open a browser and navigate to where the system is hosted.","tags":"","url":"en\/User_interface\/User_interface.html"},{"title":"Sections","text":"Sections From here the administrator can manage sections.","tags":"","url":"en\/User_interface\/Sections.html"},{"title":"Users","text":"Users From here the administrator can manage users while a section administrator can manage publishers.","tags":"","url":"en\/User_interface\/Users.html"},{"title":"Categories","text":"Categories From here the administrator and section administrator can manage categories.","tags":"","url":"en\/User_interface\/Categories.html"},{"title":"Articles","text":"Articles From here all articles that the current user can change, are listed.","tags":"","url":"en\/User_interface\/Articles.html"},{"title":"API Endpoints","text":"API Endpoints Models HTTP Method URI Action GET sections List sections POST sections Create section PUT sections\/:id Update section DELETE sections\/:id Delete section GET articles List articles POST articles Create article PUT articles\/:id Update article DELETE articles\/:id Delete article GET categories List categories POST categories Create category PUT categories\/:id Update category DELETE categories\/:id Delete category GET users List users POST users Create user PUT users\/:id Update user DELETE users\/:id Delete user Current user &amp; helpers HTTP Method URI Action GET overview Get overview (sections > contacts > articles) GET overview\/my Get articles created by current user GET user Get current user GET contacts Get available contacts in section GET roles Get available roles (for admin) GET token Get XSRF-TOKEN","tags":"","url":"en\/API_Endpoints.html"}]}